import React from 'react';
import '../index.css';

export default function AboutModal({ onClose }) {
  return (
    <div className="auth-modal">
      <div className="auth-content">
        <button className="close-btn" onClick={onClose}>×</button>
        <h2 className='about_us_head'>Про нас</h2>
        <p className='about_us_span'>Наша місія — бути поруч</p>
        <p className='about_us_text'>Ми віримо, що світ навколо можна зробити простішим, зручнішим і натхненним. Саме тому ми створюємо простір, де ви легко знаходите те, що шукаєте — без зайвих турбот, очікувань і компромісів. Ми не просто пропонуємо товари чи послуги — ми прагнемо бути тим самим рішенням, яке приносить полегшення, радість і впевненість. Усе, що ми робимо, має одну мету — допомогти вам жити повноцінно тут і зараз.</p>
        <p className='about_us_span'>Великі зміни починаються з малого</p>
        <p className='about_us_text'>Ми переконані, що найкраще — у простих речах. Саме з них починається затишок, комфорт і гармонія в повсякденному житті. Ми ділимося знаннями, надихаємо, підказуємо й підбираємо найкраще, щоб кожне ваше рішення було впевненим. Нам важливо, щоб ви не просто знаходили — а відкривали щось нове для себе. Ми прагнемо бути вашим надійним другом у світі вибору.</p>
        <p className='about_us_span'>Створюємо комфорт серійно</p>
        <p className='about_us_text'>Наше виробництво — це сучасний меблевий конвеєр, де передові технології поєднуються з гнучким підходом до якості та ціни. Ми оптимізували кожен етап, щоб зробити стильні, зручні та довговічні меблі доступними для кожного.</p>
        <p className='about_us_text'>Ми напряму співпрацюємо з постачальниками, тому можемо запропонувати ціни, нижчі за ринкові, без втрати якості. Ви отримуєте саме те, що шукаєте: затишні дивани, надійні корпусні меблі й рішення для інтер’єру, які працюють на вас.</p>
        <p className='about_us_text'>Ми дбаємо не лише про зручність, а й про безпеку — у виробництві використовуються екологічні матеріали, що відповідають сучасним стандартам.</p>
        <p className='about_us_text'>Все просто: ви замовляєте — ми створюємо
        Ми не обіцяємо дива — ми їх виготовляємо. Від першої ідеї до готового виробу — усе під контролем наших фахівців. Ви обираєте, ми реалізовуємо.<br/><span className='about_us_span retreat'>House staff — це коли зручно, доступно і без зайвого клопоту. </span></p>
      </div>
    </div>
  );
}
